{
	"domain": "asimjofa.com",
	"url": "https://asimjofa.com/collections/pashmina/products/ajki-07-embroidered-twill-3-pc",
	"description": "AJKI-07 EMBROIDERED TWILL 3 PC\n\nBy Pcs: 3 Pcs Shirt: Self Twill Trouser: Self Twill Shawl: Self Twill Color: Rust\n\nWrap yourself in the embrace of rustic charm enveloped in warm tones. This rust-colored shirt, a testament to timeless elegance is heavily embroidered with a luxurious blend of green, peach, and rust hues, accented by delicate light gold sequins, this piece radiates warmth. The matching shawl, crafted in a deeper shade of rust and featuring scalloped embroidery, adds an exquisite touch, echoing the serene beauty of a winter sunset in Kashmir.\nDESIGN DETAILS:\n\nEmbroidered front center panel on self twill\nEmbroidered front side panel left 1 on self twill\nEmbroidered front side panel right 1 on self twill\nEmbroidered front side panel left 2 on self twill\nEmbroidered front side panel right 2 on self twill\nEmbroidered back center panel on self twill\nEmbroidered back side panel left 1 on self twill\nEmbroidered back side panel right 1 on self twill\nEmbroidered back side panel left 2 on self twill\nEmbroidered back side panel right 2 on self twill\n2.5-meter embroidered border for front & back daman on self twill\nPair of embroidered sleeves with border on self twill\n2.5-meter embroidered border for front & back chaak on organza\n2.5-meter embroidered shawl with 4-side border on self twill\n4 embroidered bunches for corners of shawl on self twill\n1.5-meter wide-width self twill for trouser",
	"imageUrls": [
		"https://asimjofa.com/cdn/shop/files/005A6988.jpg?v=1731304737",
		"https://asimjofa.com/cdn/shop/files/005A7031.jpg?v=1731304737",
		"https://asimjofa.com/cdn/shop/files/005A6982.jpg?v=1731304737",
		"https://asimjofa.com/cdn/shop/files/005A6965.jpg?v=1731304737",
		"https://asimjofa.com/cdn/shop/files/005A7002.jpg?v=1731304737",
		"https://asimjofa.com/cdn/shop/files/005A7037.jpg?v=1731304737",
		"https://asimjofa.com/cdn/shop/files/005A7017.jpg?v=1731304737",
		"https://asimjofa.com/cdn/shop/files/005A7020.jpg?v=1731304737"
	]
}